/* เนื่องจากพอคิดคอนเซปขึ้นมาได่ แต่ไม่มีความสามารถพอจะเขียนจริง ขอรวบเขียนเป็นแนวคร่าวๆ ไว้นะคะ ขอบคุณที่สละเวลาอ่านค่ะ
ข้อ1.2 - ทำการเช็ค ตัวแปร index โดยกำหนดตัวแปรเป็น bool เพื่อเช็คค่า 3 ตัวแรกว่าตรงตามเงื่อนไขหรือไม่ จากนั้น
    จะทำการใช้ whlie จนถึงข้อ 1.3 
    ถ้า this.length มีค่ามากกว่าหรือเท่ากับ 3 จะเข้าเงื่อนไขที่ว่าจะทำการส่งค่าไปสู่ loop ถัดไป จากนั้นทำการ
    สร้างเงื่อนไขว่าถ้าหาก index มีค่าน้อยกว่า 0 กำหนดให้ index มีค่าเท่ากับ 0 จากนั้นเขียนค่า node ptr เท่ากับส่วนหัว หรือ this.head 
    สร้าง whlie loop ที่ index มากกว่า 0 เมื่อเป็นตามเงื่อนไขสามารถเขียนให้ไปสู่การทำงานถัดไปได้
    เพื่อกำหนดจุดเริ่ม
    ข้อ1.3 - คิดไว้ว่าน่าจะใช้เป็น bool เพื่อเขียนเช็คว่าค่าอยู่ตรงกบางตามที่โจทย์กำหนดไว้หรือไม่ หากไม่ให้เป้น false
    */